{"word": {"pro": "/plā/", "syl": "play", "name": "play\n", "rank": "top1000"}, "Phrases": [{"words": " make a play for", "definition": {"example": ["The buying spree lasted from October 2004 to January 2005 and Mr Lynch's activity convinced analysts he was attempting to make a play for the group.", "‘Developers are making a play for downtown residential space, taking advantage of of tax incentives and loans from the city of Jacksonville,’ the report says.", "You'll never believe who Trina Matheson made a play for!"], "meaning": " Attempt to attract or attain."}}, {"words": " make  (great) play of  (or with)", "definition": {"example": [" the company made great play of its recent growth in profits", "He makes great play of his non-establishment (meaning non-public school, and non-Oxbridge) background.", "He even makes great play of the fact that he used to be right-wing.", "For all their perceived monetary difficulties, Hibs continue to make great play of plans to build two football academy-type centres, though both proposals are proceeding slowly."], "meaning": "Draw attention to in an ostentatious manner, typically to gain prestige or advantage:"}}, {"words": " not playing with a full deck", "definition": {"example": [], "meaning": " see deck."}}, {"words": " play ball", "definition": {"example": [], "meaning": " see ball1."}}, {"words": " play both ends against the middle", "definition": {"example": ["The only catch is that Stoker's been losing so many fights that his manager - playing both ends against the middle - doesn't feel compelled to let Stoker know he's been contracted to take a dive in the third round.", "Like him, he was a brilliant speaker and lawyer and played both ends against the middle.", "Big Oil is hardly blameless and at the start was no doubt trying to play both ends against the middle."], "meaning": "Keep one’s options open by supporting or favoring opposing sides."}}, {"words": " play something by ear", "definition": {"example": ["Today he still can't read music; he plays instruments by ear.", "He learned to play the piano by ear, developing a talent for improvisation which, years later, he would put to good use during the filming of America: A Personal History of the United States.", "He taught himself to play a bit by ear, amused the rowdy crowds, and picked up small change."], "meaning": "Perform music without having to read from a score."}}, {"words": " play by the rules", "definition": {"example": ["Compulsory schooling defines good citizens as those who play by the rules, stay in line, and do as they're told.", "If it became too difficult to obtain parole then they could create a faction of dissident prisoners who will see no incentive in playing by the rules and addressing their offending behaviour.", "Capone is a Jamaican cop who refuses to play by the rules."], "meaning": "Follow what is generally held to be the correct line of behavior."}}, {"words": " play one's cards close to one's chest", "definition": {"example": [], "meaning": " see chest."}}, {"words": " play one's cards right  (or well)", "definition": {"example": [], "meaning": " see card1."}}, {"words": " play ducks and drakes with", "definition": {"example": [], "meaning": " see ducks and drakes."}}, {"words": " play fair", "definition": {"example": ["To continue the footballing analogy, it is like asking footballers to sign a formal declaration before each game that they will not cheat and will always play fair.", "We believe our customers want the security of a bank which is here for the long term, which plays fair and has no nasty surprises up its sleeve.", "To Sam this wasn't playing fair, but they soon found out that despite clauses in the contract of sale that forbade such enterprises there was pragmatically not much they could do."], "meaning": "Observe principles of justice; avoid cheating."}}, {"words": " play someone false", "definition": {"example": ["Sophia now sees that he has played her false. He is not her true love.", "His post-1934 correspondence and memoirs frequently contradict reliable accounts of the period, and the conclusion that his memory played him false on numerous occasions is inescapable."], "meaning": "Prove treacherous or deceitful toward someone."}}, {"words": " play fast and loose", "definition": {"example": ["Meanwhile, Chris, one of his students, is blazing away at his own novel, a historical saga that plays fast and loose with the facts about Mary, Queen of Scots.", "You already noted that Moore plays fast and loose with the facts, and mildly criticized him for it.", "This film about the Latin American revolutionary plays fast and loose with the facts."], "meaning": "Behave irresponsibly or immorally."}}, {"words": " play favorites", "definition": {"example": ["They crowded around her, and Koko, who plays favourites, asked one woman wearing red to come closer.", "People were swearing at me the whole time and accusing me of playing favourites.", "Many smash repairers say the insurance companies are going too far, and playing favourites, even amongst the preferred repairers."], "meaning": " Show favoritism toward someone or something."}}, {"words": " play the field", "definition": {"example": [], "meaning": " see field."}}, {"words": " play for time", "definition": {"synonyms": "stall, temporize, delay, hold back, hang fire, procrastinate, drag one's feetView synonyms", "example": ["Was there anything to be gained by playing for time, trying to learn more of what he might be facing?", "They're playing for time and our position is they should not be allowed to do that.", "The Government - pleading realpolitik, invoking the national interest and playing for time - seem to have pacified, at least on the surface, an angry public."], "meaning": "Use specious excuses or unnecessary maneuvers to gain time."}}, {"words": " play the game", "definition": {"example": [], "meaning": " see game1."}}, {"words": " play God", "definition": {"example": [], "meaning": " see God."}}, {"words": " play havoc with", "definition": {"example": [], "meaning": " see havoc."}}, {"words": " play hell", "definition": {"example": [], "meaning": " see hell."}}, {"words": " play hookey", "definition": {"example": [], "meaning": " see hooky1."}}, {"words": " play a  (or one's) hunch", "definition": {"example": ["When that webpage was completely open, Brant found the site's search engine and played his hunch.", "Go ahead, play your hunch, take the chance,", "‘This is no time for playing a hunch,’ Warren warned."], "meaning": "Make an instinctive choice."}}, {"words": " play into someone's hands", "definition": {"example": ["Half way through the third race there was no way I thought I would win but suddenly everything started playing into my hands and I took advantage.", "Most drivers and team engineers believe that Ferrari's advantage was exaggerated because the cool weather in Melbourne played into their hands.", "I fear I may already be playing into their hands by writing this and giving them more publicity, but I couldn't be silent."], "meaning": "Act in such a way as to unintentionally give someone an advantage."}}, {"words": " play it cool", "definition": {"example": ["I considered playing it cool, and pretending that I knew all along.", "Mom is playing it cool, but her eyes betray her real emotions.", "I fell for her too quickly, really, and she played it cool in them days."], "meaning": " Make an effort to be or appear to be calm and unemotional."}}, {"words": " play the market", "definition": {"example": ["If you have the foresight to start planning when your child is still an infant, you will be much freer to play the market and make higher risk, higher return investments in a 15 to 18-year period.", "Of course if you want to speculate or play the market, you need to acknowledge that you are taking on board, or you're voluntarily assuming, a degree of risk.", "For most stock market investors, whether pension funds or individuals playing the market from their home PC, short-term growth is the goal."], "meaning": "Speculate in stocks."}}, {"words": " a play on words", "definition": {"example": ["He said: ‘The youth church will be called Sorted, which is a bit of a play on words, because as well as being a trendy, youth culture word, ‘soter’ is Greek for salvation.", "‘The title's a play on words, really,’ he explains.", "I was unprepared, though, for the excellence of chef Willie Little's establishment Exceed - a play on words which refers to the premises, once the shop and loft for seed merchants."], "meaning": "A pun."}}, {"words": " play a part", "definition": {"example": [" social and economic factors may have also played a part ", " he personally wanted to thank those nurses and staff who had played a part in his recovery", "A sharp rise in life expectancy has also played a part.", "There is, however, a great deal of satisfaction to be gained from playing a part in developing health services.", "The financial advantage of being in an Enterprise Zone also played a part."], "meaning": "Make a contribution to a situation:"}}, {"words": " play  (or play it) safe", "definition": {"example": ["The results so far show that women prefer to play it safe than to take risks with their money.", "I'm the kind of person who would rather play it safe and lose out than risk everything and have a chance at winning.", "She had to weigh up the pros and cons - risk a long time out this spring, or play it safe and maybe miss out on a medal in front of her home crowd."], "meaning": "Take precautions; avoid risks."}}, {"words": " play to the gallery", "definition": {"example": [], "meaning": " see gallery."}}, {"words": " play a trick  (or joke) on", "definition": {"example": ["Are you sure it's not someone playing a trick on you?", "It's got to be one of our friends playing a joke on us.'", "She said: ‘When I received the phone call saying that I had won the car, I hung up the phone on them because I thought it was someone playing a joke on me.’"], "meaning": "Behave in a deceptive or teasing way toward."}}, {"words": " play truant", "definition": {"example": [], "meaning": " see truant."}}, {"words": " play with oneself", "definition": {"example": [], "meaning": " Masturbate."}}, {"words": " play with fire", "definition": {"example": ["We're playing with fire when we make huge changes to a complex system that we don't understand, as we seem to be doing with the various substances we're pumping into our atmosphere.", "Now when it comes to technological advances I have no problem, however when it involves messing with a biological system such as our bodies I believe we are playing with fire.", "Roeder's attempt to ignite his team's season with a player who has courted controversy at almost every turn was described by critics as playing with fire."], "meaning": "Take foolish risks."}}], "Phrasal verbs": [{"words": " play around  (or about)", "definition": {"example": [" you shouldn’t play around with a child’s future", "Everyone knows that when scientists play around with genes, they screw up.", "We can't play around with the future of our children.", "A lot of Christmas discs play around with the music we've grown to love over the years, but not enough try and make something unique enough to really stand out."], "meaning": "Behave in a casual, foolish, or irresponsible way:"}}, {"words": " play along", "definition": {"synonyms": "co-operate, collaborate, play the game, help, lend a hand, assist, contribute informal pitch inView synonyms", "example": [" she had to play along and be polite", "I have no desire to play along with Kelly's little machinations.", "I figured I could play along with the ‘just friends’ bit, then ply him with alcohol and take advantage of him.", "When Sascha first told me he was a neuropsychologist, I thought he was joking, so I decided to play along with it and told him I was a nurse."], "meaning": "Pretend to cooperate:"}}, {"words": " play someone along", "definition": {"example": ["Jackie Lye as Gill the good time girl playing Mark along is certainly lust on legs and captures this temptress perfectly.", "Rather than telling the ‘buyer’ to take a running jump, Jeff decided to play him along while at the same time complaining about his actions to eBay.", "I had no idea what I was doing, just that I had to play him along and find us a way out of this."], "meaning": " Deceive or mislead someone over a period of time."}}, {"words": " play something back", "definition": {"example": ["The comments were only noticed after the official Press briefing, when the recordings were played back.", "After recording one track, you can play it back while recording another.", "Mike played the tape back and the song sounded awesome."], "meaning": "Play sounds that one has recently recorded, especially to monitor recording quality."}}, {"words": " play something down", "definition": {"synonyms": "make light of, make little of, gloss over, de-emphasize, downplay, understate; soft-pedal, tone down, diminish, trivialize, underrate, underestimate, undervalue; disparage, belittle, scoff at, sneer at, shrug off informal pooh-poohView synonyms", "example": [" he tried to play down the seriousness of his illness", "But the risk is played down by the government body meant to ensure that our food is safe, the Food Standards Agency.", "Not surprisingly, this whole episode was played down by the press.", "Sharon plays it down, insisting it'll be a small affair."], "meaning": "Represent something as being less important than it in fact is:"}}, {"words": " play someone off", "definition": {"example": [" detectives employ more than one informant so as to play one off against the other", "It's divide-and-rule, playing us off in a grim bidding war of who will work for the least money.", "Don't let the property developers play us off against each other.", "‘Eamon believed that Today FM were trying to play him off against Bird as a way of keeping down the size of his salary,’ said one station insider."], "meaning": "Bring people into conflict or competition for one’s own advantage:"}}, {"words": " play off", "definition": {"example": ["Sadly, aggregate scores counted for nothing in those days, and having won and lost a leg apiece, the teams played off.", "The third and fourth place teams also played off, with the loser eliminated and the winner playing the loser of the one versus two game.", "The winners of their respective matches will contest the final, while the losers will play off for the bronze medal."], "meaning": "(Of two teams or competitors) play an extra game or match to decide a draw or tie."}}, {"words": " play on", "definition": {"synonyms": "exploit, take advantage of, use, turn to (one's) account, profit by, capitalize on, trade on, milk, abuseView synonyms", "example": [" he played on his opponent’s nerves", "It plays on the fact that there is nothing else up there and you'll probably be desperate for something to eat, or at least to drink.", "Any politician who plays on race is a danger to the country and should never be allowed to run in any public office.", "Any company that asks for large amounts of money or plays on people's greed or fears should be immediately suspect."], "meaning": "Exploit (a weak or vulnerable point in someone):"}}, {"words": " play someone out", "definition": {"example": ["There was a sense that I was played out, I was finished.", "There was nowhere else I could go. I was played out.", "By this time I was played out and so were Beck and Nora."], "meaning": " Drain someone of strength or life."}}, {"words": " play something out", "definition": {"example": ["Such scenes are played out across the whole of Britain with a fair degree of regularity, though they remain relatively rare north of the border.", "The little church has seen hundred of years pass by and lives long forgotten have played their dramas out around it.", "It is just that, here, all life's dramas are played out in front of the most spectacular backdrop you could hope to find."], "meaning": "Act the whole of a drama; enact a scene or role."}}, {"words": " play something up", "definition": {"synonyms": "emphasize, accentuate, call attention to, point up, underline, highlight, spotlight, foreground, feature, stress, accentView synonyms", "example": [" the mystery surrounding his death was played up by the media", "Predictions of 450,000 lost jobs are played up in the media, while the jobs that will be created to combat global warming are ignored.", "Now governments can get more support by playing the threat up and issuing constant warnings.", "His warnings were unheeded, and, as he predicted, Republicans played the issue up in the final weeks of the campaign."], "meaning": "Emphasize the extent or importance of something:"}}, {"words": " play up to", "definition": {"synonyms": "ingratiate oneself with, curry favor with, court, fawn over, make up to, toady to, crawl to, pander to, flatter informal soft-soap, suck up to, butter up, lick someone's bootsView synonyms", "example": ["He's also a mass of contradictions, desperately playing up to more successful ex-schoolmates and then verbally and physically assaulting them.", "When every major presidential candidate contributes to a candidate or plays up to a labor activist in Iowa, New Hampshire or South Carolina, that makes it possible for the recipients of this attention to choose relatively freely."], "meaning": "Exploit, trade on, or make the most of."}}], "See": ["come the old soldier", "play-play", "play on", "play ball", "fair play"], "Origin": " Old English pleg(i)an 'to exercise', plega 'brisk movement', related to Middle Dutch pleien 'leap for joy, dance'.\nMore\nIn Old English plegan or plegian meant ‘to exercise’, while plega meant ‘brisk movement or activity’, and could also be used to describe a dramatic performance on stage. These are the first uses of play. Today terms such as swordplay and gunplay preserve the old ‘brisk movement’ sense of the noun. To play with fire is to take foolish risks with something potentially dangerous. The proverb if you play with fire you get burned dates from the late 19th century, though a similar sentiment is expressed by the poet Henry Vaughan in 1655: ‘I played with fire, did counsel spurn…But never thought that fire would burn / Or that a soul could ache.’ Play it again, Sam is a popular misquotation from the film Casablanca ( 1942). Although these precise words are never actually spoken in the film, Humphrey Bogart does say ‘If she can stand it, I can. Play it!’, and earlier in the film Ingrid Bergman says ‘Play it, Sam. Play “As Time Goes By”.’ The US magazine Playboy was founded in 1953 by Hugh Hefner. A playboy was at first, back in 1616, a boy actor. The modern sense, ‘an irresponsible pleasure-seeking man’, started in Ireland, and is first recorded in the 1820s.", "Nearby": ["playact"], "homograph": [], "definition": [{"partOfSpeech": "verb", "sense": [{"synonyms": "amuse oneself, entertain oneself, enjoy oneself, have fun; relax, occupy oneself, divert oneself; frolic, frisk, romp, caper informal mess aroundView synonyms", "subsense": [{"example": [" I want to play Monopoly", "Too much emphasis is placed on solitary activities such as playing video games or watching television.", "As such, the games were quite fun to play, despite their rather basic gameplay.", "They also played board games like checkers, chess, and dominoes."], "meaning": " Engage in (a game or activity) for enjoyment:"}, {"example": [" the boys were playing cops and robbers", "My children don't play with guns, but at lunchtime some were playing at shooting each other.", "As a child, she had played at being a gun-toting cowgirl.", "It is like little boys and girls playing doctors and nurses."], "meaning": "Amuse oneself by engaging in imaginative pretense:"}, {"example": [" stars who play at being ordinary", "So that she could play at being a countrywoman at Versailles, Louis XV provided her with a hermitage comprising a pavilion, a menagerie, a pasture, dairy and kitchen garden.", "I mean, they were just playing at it before, but now they're completely serious.", "Lemar doesn't actually seem to know they're just playing at being in love with each other."], "meaning": " Engage in without proper seriousness or understanding:"}, {"example": [" she likes to play with people’s emotions", "No-one would exploit real people and play with their emotions and date them just for a piece of art.", "Do you think I've just been playing with your emotions this last fortnight?", "She should have known that Eddie was just playing with her heart like everyone else he flirted with."], "meaning": " Treat inconsiderately for one’s own amusement:"}, {"example": [" has somebody been playing with the thermostat?", "Her salad was whisked away and she moved onto playing with the noodles in her pasta.", "Cable tidies will help prevent children from tripping over cables and playing with them.", "Sarah plays with her food with her fork, picking out the chocolate chips and making a pile of them at the side of her plate."], "meaning": " Fiddle or tamper with:"}], "example": [" the children were playing outside", " her friends were playing with their dolls", "Do you know who your children are playing with or where they are playing?", "Let her use up her energy by playing outside every day and enjoying other lively activities.", "Last week Cromane Beach was a hive of activity with children playing, swimming and enjoying picnics."], "meaning": " Engage in activity for enjoyment and recreation rather than a serious or practical purpose:"}, {"subsense": [{"example": [" the Red Sox will play two games on Wednesday", "Omagh were forced to play three championship matches in eight days in October.", "Yet it was difficult not to feel sorry for Latvia, playing their first match in a major tournament.", "In the end the match was played amid a torrential downpour, plus thunder and lightning."], "meaning": "Participate in (an athletic match or contest):"}, {"synonyms": "compete against, take on, challenge, vie with, face, go up againstView synonyms", "example": [" the team will play France on Wednesday", "In the Test matches, we are playing the second-ranked team in the world so that's very difficult in itself.", "It is never easy playing a team that is fighting relegation and has had two bad results on the spin.", "We may just get a bit tense, and that comes down to inexperience, playing the best team in the world."], "meaning": "Compete against (another player or team) in an athletic match or contest:"}, {"example": [" he needs financial backing, but the bank won’t play", "The media got another warning from the White House this week: be careful what you do and say, or we won't play.", "If the lawyers had approved the meetings and then FBI had refused to play, the buck would have been passed to the Bureau."], "meaning": " Be cooperative:"}, {"example": [" he played shortstop", "Now, because they have seen how I play for the national team, they have a new respect for British football.", "It obviously did the trick, because I became a regular in the first team and went on to play for England.", "The ultimate goal is to play for Scotland, but there are lots of things before that."], "meaning": " Be part of a team, especially in a specified position, in a game:"}, {"example": ["Steven Gerrard plays a long ball from left to right, which Luis Garcia fails to control properly and immediately gives away.", "Trezeguet is caught marginally offside as Henry plays the ball through to him.", "Emre plays a cross-field ball from left to right."], "meaning": "Strike (a ball) or execute (a stroke) in a game."}, {"example": [" the manager will want to play the right-handed Curtis", "Whether England manager Clive Woodward plays him at full-back, on the wing or even at centre on Saturday, he is a certain starter.", "Woodward, desperate to get the best out of him, has played him in four positions.", "He was played in the wrong position and did not do too well, but as soon as he moved up front he has got better and better."], "meaning": "Assign to take part in an athletic contest, especially in a specified position:"}, {"example": [" he played his queen", "Somebody always has to play the role of banker as well as playing their own piece.", "If you expose the queen of spades, then the first time that someone leads a spade you are not allowed to play the queen if you have other spades.", "If you have the Ace of trump, you are guaranteed to win the trick you play that in."], "meaning": "Move (a piece) or display (a playing card) in one’s turn in a game:"}, {"example": [" he didn’t play the ponies", "Another important factor in playing the lottery is to play within your means.", "I don't play the lotto and I avoid gambling at all costs.", "The money people spend playing the lottery keeps some of these taxes from going up."], "meaning": "Bet or gamble at or on:"}], "example": [" I play softball and tennis", "I used to play netball when I was a teenager, but was never very good at it.", "Another new initiative was launched this week to get more children playing sport.", "He enjoyed many sports, and played table tennis for Manchester and tennis for Manchester University."], "meaning": " Take part in (a sport):"}, {"synonyms": "act (the part of), take the role of, appear as, portray, depict, impersonate, represent, render, perform, enact formal personateView synonyms", "subsense": [{"example": [" he was proud to be playing opposite a famous actor", "In The Silver Fleet, she plays opposite another star of the London stage, Ralph Richardson.", "He has also played in Irish language productions at the Abbey Theatre.", "Taylor might as well have been playing opposite a wooden Indian for all the response she got from him."], "meaning": " Perform in a theatrical production or on film:"}, {"example": [" the show was one of the best we ever played", "The Rolling Stones played their debut concert at the Marquee club in London in 1962.", "Not only is he alive, but he's healthy, just short of 60 and still playing packed-out concerts.", "Jools Holland is playing an open-air concert near Tunbridge Wells soon."], "meaning": "Put on or take part in (a theatrical performance or concert):"}, {"example": ["Reynolds plays the Green Room Sunday night and the Railway Club on Wednesday.", "He was sheer magic at Garter Lane on his previous visit and should not be missed when he plays the Theatre Royal.", "The brilliant Backbeat Beatles play the Pavilion Theatre in Bournemouth on Monday."], "meaning": "Give a dramatic performance at (a particular theater or place)."}, {"example": [" the skipper played the innocent, but smuggled goods were found on his vessel", "A cynic would say that people enjoy playing the victim and jumping on the grief bandwagon, they enjoy the attention and the sympathy.", "As a young girl, Cora had always enjoyed playing the nurse for her brother or her cousins.", "She stood in the corner playing the shy bride in her long red bridal dress."], "meaning": "Behave as though one were (a specified type of person):"}, {"example": [" don’t imagine you can play me for a fool", "She plays him for a fool, often feigning helplessness just to see what lengths he will go to in order to prove his love for her.", "A councillor has accused a brewery of playing Bexley Council for a mug over a pub's opening hours.", "Are you just playing Rob for a sucker, Amber?"], "meaning": " Treat someone as being of (a specified type):"}], "example": [" she played Ophelia", "In my next film I'm playing a really intense character and I'm nervous.", "Laurence Olivier plays Lord Nelson, and Vivien Leigh is Emma, Lady Hamilton, who becomes his lover.", "He plays characters his age and doesn't try to pretend he's 20 years younger than he actually is."], "meaning": " Represent (a character) in a theatrical performance or on film:"}, {"subsense": [{"synonyms": "perform, make music, jamView synonymsmake, produce, reproduce; blow, toot; plunk, bang out; soundView synonyms", "example": [" he taught himself to play the violin", "As well as playing the flute Rosie plays the piano, violin, guitar and sings.", "She has taught herself to play rhythm guitar and also plays piano and violin.", "Franz learnt to play the piano and the violin from his father and brothers, and later the viola."], "meaning": "Possess the skill of performing upon (a musical instrument):"}, {"example": [" they played a violin sonata", "The concertmaster played a note on his violin and Lev tuned his instrument to it.", "Inconspicuously, a three piece ensemble plays background music.", "The best pieces of American Jazz music will be played and performed on stage."], "meaning": "Produce (notes) from a musical instrument; perform (a piece of music):"}, {"example": ["And a third of adults use digital, satellite and cable TV to play the new radio stations.", "By 9 pm, I had watched a dvd and played some records, and I was ready for something else.", "Write in to any radio stations you know of and demand that they play this record."], "meaning": "Make (a music player, disc, radio, etc.) produce sounds."}, {"example": [" somewhere within, a harp was playing", "We then walked in silence to the studio, where the last record was still playing.", "He leaves the front door slightly ajar to hear the early Dylan and Stones records playing from inside.", "He pauses to savour the Kylie Minogue song playing over the bar sound system."], "meaning": " (Of a musical instrument, music player, radio, etc.) produce sounds:"}, {"example": [" the bagpipes played them out of the dining room", "Brother James, would you play the girls in please?", "The procession then moved on the Town Hall to be played in by a pianist performing the ‘Uist Tramping Song’."], "meaning": "Accompany (someone) with music as they are moving in a specified direction:"}], "example": [" we heard someone playing a harmonica", " [no object]: a pianist who will play for us", "While Natalie was calling my mom, I heard someone start playing the drums really loud.", "She was greatly impressed when she heard Len playing his guitar, and even more impressed with how he could play the piano.", "As a teenager he played guitar and harmonica with local bands and skiffle and rock ‘n’ roll groups."], "meaning": " Perform on (a musical instrument):"}, {"synonyms": "dance, flit, ripple, touch; sparkle, glintView synonyms", "subsense": [{"example": ["The garden was beautiful, plants and shrubs tumbling around a vibrant lawn in the centre of which a fountain tinkled and played.", "In the centre of the lush garden, an elaborate marble fountain played, spraying sparkling jewels of water into the air.", "The lawns are mown, the box hedge parterres are neatly clipped and the central fountain plays gently in the sunshine."], "meaning": "(Of a fountain or similar source of water) emit a stream of gently moving water."}], "example": [" a smile played about her lips", "Pulling the door shut behind her, she leaned against it, a light smile playing across her lips.", "His soft babyish snores caused her heart to melt and a light smile played upon her lips.", "Underneath the floppy hair and the trademark goatee, there is a smile playing on his lips, a twinkle in his eye."], "meaning": " Move lightly and quickly, so as to appear and disappear; flicker:"}, {"subsense": [], "example": ["We spotted that the boat nearest to us had an angler playing a fish and that same fish leapt right in front of our path.", "Holding the rod high whilst playing a fish is often a recipe for disaster, especially when the fish is close to the boat.", "Remember the whole rod should be used in playing the fish."], "meaning": " Allow (a fish) to exhaust itself pulling against a line before reeling it in."}]}, {"partOfSpeech": "noun", "sense": [{"synonyms": "amusement, entertainment, relaxation, recreation, diversion, distraction, leisure; enjoyment, pleasure, fun, games, fun and games; horseplay, merrymaking, revelry informal living it upView synonyms", "subsense": [{"example": [" I flinched, but only in play", "Teach kids to respect the cat, and do not allow them to chase or corner the cat even in play.", "Gordy and Stevie were fighting, but Rhiannon knew it was only in play."], "meaning": "Behavior or speech that is not intended seriously:"}, {"example": [" play families are arranged in play houses"], "meaning": " Designed to be used in games of pretense; not real:"}], "example": [" a child at play may use a stick as an airplane", "The children introduced themselves through song and words and we watched them at play.", "There's a pause in the game, and the TV begins showing cute little kittens at play.", "While at play, toddlers and young children are usually in the care of older siblings."], "meaning": "Activity engaged in for enjoyment and recreation, especially by children:"}, {"subsense": [{"example": [" he maintained the same rhythm of play throughout the game", "Today, we have got used to watching almost constant attacking play.", "There was zest and quick movement to United's play despite spells of control by Rangers.", "The first half was close with neither side gaining dominance in any area of play."], "meaning": "The action or manner of engaging in a sport or game:"}, {"example": [" the ball was put in play", "He walks off the pitch to get treatment, Nigeria kick the ball out of play so he can come back on.", "Prop Howard Carr kicked a penalty into touch and the ball bounced back into play after hitting a tree.", "The ball goes out of play and he gets to his feet with the air about him of a man who'd settle for a corner."], "meaning": "The status of the ball in a game as being available to be played according to the rules:"}, {"synonyms": "action, activity, operation, working, function; interaction, interplayView synonyms", "example": [" luck comes into play", "The Corsa comes with electric power steering, which only comes into play when needed.", "This is where personal campaigning by influential people here comes into play.", "It is only when more than two teams finish level on points and they have all beaten one another that run rate comes into play."], "meaning": "The state of being active, operative, or effective:"}, {"example": [" the best play is to lead the 3 of clubs", "But Woodson is getting more chances to make big plays in the passing game this season.", "He is strong enough to play off blocks and make plays in the running game and agile enough to be an asset in coverage.", "At moments in a game great plays are needed, no matter what the defense, and the superstar shifts gears."], "meaning": "A move or maneuver in a sport or game:"}, {"example": ["A gentleman complained to Talleyrand of having been insulted by a charge of cheating at play."], "meaning": " Gambling."}], "example": [" rain interrupted the second day’s play", "He did admit that he had felt in charge of the match before play was halted.", "After two hours and 17 minutes of play the match was abandoned with Greenock on 136 for three.", "They were up against it in this match too, conceding a goal after just 35 seconds of play."], "meaning": "The conducting of an athletic match or contest:"}, {"synonyms": "drama, theatrical work; screenplay, comedy, tragedy; production, performance, show, sketchView synonyms", "subsense": [], "example": [" the actors put on a new play", "Her career has included stage roles in plays by Shakespeare, Chekhov and Ibsen.", "The Globe Theatre is a reconstruction of the theatre in which Shakespeare's plays were originally staged.", "I went to see a double bill of two plays by Harold Pinter."], "meaning": "A dramatic work for the stage or to be broadcast:"}, {"subsense": [{"example": [" our policy allows the market to have freer play", "It also recognises the fact that the free play of markets creates problems for society."], "meaning": "Scope or freedom to act or operate:"}, {"example": [" the artist exploits the play of light across the surface", "Be sure to visit at different times of the day and evening to enjoy the play of light.", "The deliberate use of an uneven surface allows for the greater play of light.", "He stopped and leaned over the bridge wall to watch the play of light on the river."], "meaning": "Light and constantly changing movement:"}], "example": [" the steering rack was loose, and there was a little play", "The action is smooth, the cylinder locks up tightly with very little play, and the trigger pull is light and crisp.", "Since then there's been a lot of play in the steering."], "meaning": "The space in or through which a mechanism can or does move:"}]}], "rhyme": "affray, agley, aka, allay, Angers, A-OK, appellation contrôlée, array, assay, astray, au fait, auto-da-fé, away, aweigh, aye, bay, belay, betray, bey, Bombay, Bordet, boulevardier, bouquet, brae, bray, café au lait, Carné, cassoulet, Cathay, chassé, chevet, chez, chiné, clay, convey, Cray, crème brûlée, crudités, cuvée, cy-pres, day, decay, deejay, dégagé, distinguée, downplay, dray, Dufay, Dushanbe, eh, embay, engagé, essay, everyday, faraway, fay, fey, flay, fray, Frey, fromage frais, gainsay, Gaye, Genet, giclee, gilet, glissé, gray, grey, halfway, hay, heigh, hey, hooray, Hubei, Hué, hurray, inveigh, jay, jeunesse dorée, José, Kay, Kaye, Klee, Kray, Lae, lay, lei, Littré, Lough Neagh, lwei, Mae, maguey, Malay, Mallarmé, Mandalay, Marseilles, may, midday, midway, mislay, misplay, Monterrey, Na-Dene, nay, né, née, neigh, Ney, noway, obey, O'Dea, okay, olé, outlay, outplay, outstay, outweigh, oyez, part-way, pay, Pei, per se, pince-nez, portray, pray, prey, purvey, qua, Quai d'Orsay, Rae, rangé, ray, re, reflet, relevé, roman-à-clef, Santa Fé, say, sei, Shar Pei, shay, slay, sleigh, sley, spae, spay, Spey, splay, spray, stay, straightaway, straightway, strathspey, stray, Sui, survey, sway, Taipei, Tay, they, today, tokay, Torbay, Tournai, trait, tray, trey, two-way, ukiyo-e, underlay, way, waylay, Wei, weigh, wey, Whangarei, whey, yea ", "Usage": null, "Derivatives": [{"words": " playability", "definition": {"example": ["Structured like Grand Theft Auto, but without the same emphasis on vehicles, this game is still detailed enough to offer plenty of playability.", "Sounds rubbish by today's Playstation standards I know, but this game had something most modern games lacked - serious playability.", "Alternatively, nylon stringed guitars offered superior playability and greater scope for advancement."]}}, {"words": " playable", "definition": {"example": ["The drainage system has proved to be very successful and kept the pitch playable throughout the winter period.", "The first game was so-so; slower than Sonic and less playable than Mario.", "It grew to be an 18-hole course, but the long grass meant it was only playable between September and April."]}}]}