{"word": {"pro": "/ˈtrou(ə)l/", "name": "trowel\n", "syl": "trow·el"}, "Phrases": null, "Phrasal verbs": null, "See": [], "Origin": " Middle English (as a noun): from Old French truele, from medieval Latin truella, alteration of Latin trulla 'scoop', diminutive of trua 'skimmer'.\nMore\nThe word trowel is from Old French truele, an alteration of Latin trulla ‘scoop’.", "Nearby": ["Troyes"], "homograph": [], "definition": [{"partOfSpeech": "noun", "sense": [{"subsense": [], "example": ["Remove the bricks and use a pointed trowel to apply mortar to the concrete base, but do not go beyond the chalk lines.", "Using a trowel, apply plaster over the hole covering the patch and filling the entire hole.", "Using your chalk line as a guide, spread the mortar with a notched trowel over a 2x5-foot section of the floor."], "meaning": "A small handheld tool with a flat, pointed blade, used to apply and spread mortar or plaster."}, {"subsense": [], "example": ["To help you determine planting depths and plant spacing, garden trowels often come with measurements right on the metal.", "Probably one of the most-used small tools is the trowel, which is ideal for digging small holes for planting and transplanting annuals, vegetables and other smaller plants.", "Chris sighed and kept on digging his trowel into the earth."], "meaning": "A small handheld tool with a curved scoop for lifting plants or earth."}]}, {"inflectionGroup": " (trowels, troweling, troweled ; British trowels, trowelling, trowelled)", "partOfSpeech": "verb", "sense": [{"subsense": [], "example": ["First, a scratch coat is troweled onto the lath; the plaster oozes through the lath and grips the backing when it hardens.", "When troweling it on, push and move the material, creating varying textures.", "Final troweling operations are completed with riding trowels."], "meaning": "Apply or spread with or as if with a trowel."}]}], "rhyme": "avowal, Baden-Powell, bowel, disembowel, dowel, Howell, Powell, rowel, towel, vowel ", "Usage": null, "Derivatives": null}